In [1]:
import MySQLdb
from pandas.io import sql
import matplotlib.pyplot as plt

In [2]:
db = MySQLdb.connect(host="localhost",    
                     user="root",         
                     passwd="Commercial549!",  
                     db="lahman2016")

In [3]:
#show tables
query = """SHOW TABLES"""
sql.read_sql(query, con = db).head()

  Tables_in_lahman2016
0          AllstarFull
1          Appearances
2       AwardsManagers
3        AwardsPlayers
4  AwardsShareManagers

# Write a query to show the top ten home run hitters

In [4]:
query = """
SELECT 
    batting.playerID as playerID,
    master.namefirst AS firstname,
    master.namelast AS lastname,
    SUM(batting.hr) AS hrs
FROM 
    lahman2016.batting
LEFT JOIN 
    lahman2016.master
ON 
    batting.playerID = master.playerID
GROUP BY 
    playerID
ORDER BY 
    hrs DESC
LIMIT 10
"""

sql.read_sql(query, con=db)

    playerID firstname   lastname    hrs
0  bondsba01     Barry      Bonds  762.0
1  aaronha01      Hank      Aaron  755.0
2   ruthba01      Babe       Ruth  714.0
3  rodrial01      Alex  Rodriguez  696.0
4   mayswi01    Willie       Mays  660.0
5  griffke02       Ken    Griffey  630.0
6  thomeji01       Jim      Thome  612.0
7   sosasa01     Sammy       Sosa  609.0
8  pujolal01    Albert     Pujols  591.0
9  robinfr02     Frank   Robinson  586.0

## Write a query to return the ten players to the most home runs in the least amount of games

In [5]:
query = """
select 
    batting.playerID as playerID,
    master.namefirst AS firstname,
    master.namelast AS lastname,
    SUM(batting.hr) as hrs,
    SUM(batting.g) as games
    FROM 
    lahman2016.batting
LEFT JOIN 
    lahman2016.master
ON 
    batting.playerID = master.playerID
GROUP BY 
    playerID
HAVING
hrs > '500'
ORDER BY
    games ASC
LIMIT 10
    
"""

sql.read_sql(query, con=db)

    playerID firstname  lastname    hrs   games
0  mcgwima01      Mark   McGwire  583.0  1874.0
1  willite01       Ted  Williams  521.0  2292.0
2  ramirma02     Manny   Ramirez  555.0  2302.0
3   foxxji01    Jimmie      Foxx  534.0  2317.0
4  thomafr04     Frank    Thomas  521.0  2322.0
5   sosasa01     Sammy      Sosa  609.0  2354.0
6  matheed01     Eddie   Mathews  512.0  2391.0
7  mantlmi01    Mickey    Mantle  536.0  2401.0
8  schmimi01      Mike   Schmidt  548.0  2404.0
9  ortizda01     David     Ortiz  541.0  2408.0

# Write a query that returns the player with the highest batting average and lowest fielding percentage, where that player has been in over 1,000 games

In [6]:
query = """
SELECT 
    batting_grouped.playerid AS playerid,
    master.namefirst AS firstname,
    master.namelast AS lastname,
    SUM(batting_grouped.h)/SUM(batting_grouped.ab) AS batting_avg,
    (SUM(fielding_grouped.po)+SUM(fielding_grouped.a))/(SUM(fielding_grouped.a)+SUM(fielding_grouped.e)+SUM(fielding_grouped.po)) AS fielding_percentage,
    SUM(batting_grouped.g) as games
FROM 
    lahman2016.batting_grouped
LEFT JOIN
    lahman2016.fielding_grouped
ON
    lahman2016.batting_grouped.playerid = lahman2016.fielding_grouped.playerid AND lahman2016.batting_grouped.yearid = lahman2016.fielding_grouped.yearid
LEFT JOIN
    lahman2016.master
ON
    batting_grouped.playerid = master.playerid
GROUP BY 
    playerid, firstname, lastname
HAVING
    games > '1000'
ORDER BY 
    batting_avg DESC,
    fielding_percentage ASC
LIMIT
    1,1

    
"""

sql.read_sql(query, con=db)

   playerid firstname lastname  batting_avg  fielding_percentage   games
0  cobbty01        Ty     Cobb       0.3664               0.9614  3035.0